#использовать "../src/core"
#Использовать asserts
#Использовать logos
#Использовать tempfiles
#Использовать json

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;

	ИменаТестов.Добавить("ТестДолжен_ГенерацииОтчетаClover");
	// ИменаТестов.Добавить("ТестДолжен_ПроверитьВыгрузкуПараметровВКласс");
	// ИменаТестов.Добавить("ТестДолжен_ПроверитьПоискИЧтениеФайлаПараметров");
	// ИменаТестов.Добавить("ТестДолжен_ПроверитьПарсингОпций");
	// ИменаТестов.Добавить("ТестДолжен_ПроверитьПарсингМассивовОпций");


	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ГенерацииОтчетаClover() Экспорт

	РабочаяДиректория = ТекущийСценарий().Каталог;

	ПутьКФайлуСтатистики = ОбъединитьПути(РабочаяДиректория, "fixtures", "fake-coverage.json");

	ВременныйКаталог = ВременныеФайлы.СоздатьКаталог();
	
	ПроцессорГенерации = Новый ГенераторОтчетаПокрытия();

	ПроцессорГенерации.ФайлСтатистики(ПутьКФайлуСтатистики)
		.РабочийКаталог(ВременныйКаталог)
		.КаталогИсходников("./fixtures/fake")
		.GenericCoverage("genericCoverage.xml")
		.Clover("fake-package", "clover.xml")
		.Сформировать();

	ФайлClover = Новый Файл(ОбъединитьПути(ВременныйКаталог, "clover.xml"));
	ФайлGenericCoverage = Новый Файл(ОбъединитьПути(ВременныйКаталог, "genericCoverage.xml"));
	
	Ожидаем.Что(ФайлClover.Существует(), СтрШаблон("Файл <%1> с результатами покрытия не существует!", ФайлClover.ПолноеИмя)).ЭтоИстина();

	Ожидаем.Что(ФайлGenericCoverage.Существует(), СтрШаблон("Файл <%1> с результатами покрытия не существует!", ФайлGenericCoverage.ПолноеИмя)).ЭтоИстина();

	ВременныеФайлы.УдалитьФайл(ВременныйКаталог);

КонецПроцедуры

Процедура ПодготовитьТестовыеДанные()

	

КонецПроцедуры