#использовать "../src/core"
#Использовать asserts
#Использовать logos
#Использовать tempfiles
#Использовать json

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;

	ИменаТестов.Добавить("ТестДолжен_ГенерацииОтчетаПоФайлу");
	ИменаТестов.Добавить("ТестДолжен_ГенерацииОтчетаПоНесколькимФайлам");

	// ИменаТестов.Добавить("ТестДолжен_ПроверитьВыгрузкуПараметровВКласс");
	// ИменаТестов.Добавить("ТестДолжен_ПроверитьПоискИЧтениеФайлаПараметров");
	// ИменаТестов.Добавить("ТестДолжен_ПроверитьПарсингОпций");
	// ИменаТестов.Добавить("ТестДолжен_ПроверитьПарсингМассивовОпций");


	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ГенерацииОтчетаПоФайлу() Экспорт

	РабочаяДиректория = ТекущийСценарий().Каталог;

	ПутьКФайлуСтатистики = ОбъединитьПути(РабочаяДиректория, "fixtures", "fake-coverage.json");

	ВременныйКаталог = ВременныеФайлы.СоздатьКаталог();
	
	ПроцессорГенерации = Новый ГенераторОтчетаПокрытия();

	ПроцессорГенерации.ФайлСтатистики(ПутьКФайлуСтатистики)
		.РабочийКаталог(ВременныйКаталог)
		.ОтносительныеПути()
		.КаталогИсходников("./fixtures/fake")
		.GenericCoverage("genericCoverage.xml")
		.Clover("fake-package", "clover.xml")
		.Cobertura()
		.Сформировать();

	ФайлClover = Новый Файл(ОбъединитьПути(ВременныйКаталог, "clover.xml"));
	ФайлGenericCoverage = Новый Файл(ОбъединитьПути(ВременныйКаталог, "genericCoverage.xml"));
	ФайлCoverage = Новый Файл(ОбъединитьПути(ВременныйКаталог, "coverage.xml"));
	
	// Ожидаем.Что(ФайлClover.Существует(), СтрШаблон("Файл <%1> с результатами покрытия не существует!", ФайлClover.ПолноеИмя)).ЭтоИстина();

	Ожидаем.Что(ФайлGenericCoverage.Существует(), СтрШаблон("Файл <%1> с результатами покрытия не существует!", ФайлGenericCoverage.ПолноеИмя)).ЭтоИстина();

	Ожидаем.Что(ФайлCoverage.Существует(), СтрШаблон("Файл <%1> с результатами покрытия не существует!", ФайлCoverage.ПолноеИмя)).ЭтоИстина();

	ВременныеФайлы.УдалитьФайл(ВременныйКаталог);

КонецПроцедуры


Процедура ТестДолжен_ГенерацииОтчетаПоНесколькимФайлам() Экспорт

	РабочаяДиректория = ТекущийСценарий().Каталог;

	ВременныйКаталог = ВременныеФайлы.СоздатьКаталог();
	
	НаполнитьКаталогДанными(ВременныйКаталог);

	ПроцессорГенерации = Новый ГенераторОтчетаПокрытия();

	ПроцессорГенерации.ИмяФайлаСтатистики("fake-coverage*.json")
		.РабочийКаталог(ВременныйКаталог)
		.ОтносительныеПути()
		.ЗаменитьПуть("/fake-path", "./fixtures/fake")
		.КаталогИсходников("./fixtures/fake")
		.GenericCoverage("genericCoverage.xml")
		.Clover("fake-package", "clover.xml")
		.Cobertura()
		.Сформировать();

	ФайлClover = Новый Файл(ОбъединитьПути(ВременныйКаталог, "clover.xml"));
	ФайлGenericCoverage = Новый Файл(ОбъединитьПути(ВременныйКаталог, "genericCoverage.xml"));
	ФайлCoverage = Новый Файл(ОбъединитьПути(ВременныйКаталог, "coverage.xml"));
	
	// Ожидаем.Что(ФайлClover.Существует(), СтрШаблон("Файл <%1> с результатами покрытия не существует!", ФайлClover.ПолноеИмя)).ЭтоИстина();

	Ожидаем.Что(ФайлGenericCoverage.Существует(), СтрШаблон("Файл <%1> с результатами покрытия не существует!", ФайлGenericCoverage.ПолноеИмя)).ЭтоИстина();

	Ожидаем.Что(ФайлCoverage.Существует(), СтрШаблон("Файл <%1> с результатами покрытия не существует!", ФайлCoverage.ПолноеИмя)).ЭтоИстина();
	
	ТаблицаПокрытия = ПроцессорГенерации.ПолучитьТаблицуСтатистикиПокрытия();

	Ожидаем.Что(ТаблицаПокрытия.Количество(), СтрШаблон("Данные о покрытие должны быть равны <%1> с результатами <36>", ТаблицаПокрытия.Количество())).Равно(36);


	ВременныеФайлы.УдалитьФайл(ВременныйКаталог);

КонецПроцедуры

Процедура НаполнитьКаталогДанными(Каталог)

	РабочаяДиректория = ТекущийСценарий().Каталог;

	ПутьКФайлуСтатистики = ОбъединитьПути(РабочаяДиректория, "fixtures", "fake-coverage.json");

	КопироватьФайл(ПутьКФайлуСтатистики, ОбъединитьПути(Каталог, "fake-coverage-part2.json"));
	
	ПутьКФайлуСтатистики = ОбъединитьПути(РабочаяДиректория, "fixtures", "fake-coverage-part1.json");

	КопироватьФайл(ПутьКФайлуСтатистики, ОбъединитьПути(Каталог, "fake-coverage-part1.json"));

КонецПроцедуры

Лог = Логирование.ПолучитьЛог("oscript.lib.coverage");
Лог.УстановитьУровень(УровниЛога.Отладка);